{
  "nav": {
    "title": "My Portfolio",
    "home": "Inicio",
    "about": "Acerca de",
    "work": "Trabajo",
    "blog": "Blog",
    "contact": "Contacto",
    "language": "Idioma",
    "languageEn": "Inglés",
    "languageEs": "Español",
    "languageFr": "Francés",
    "toggleColorMode": "Modo"
  },
  "weather-widget": {
    "loading": "Cargando",
    "inactiveText": "¿Cómo está el clima en mi ubicación?"
  },
  "home": {
    "greeting": "👋 ¡Hola, soy JC!",
    "intro": "Soy ingeniero front-end sénior con más de 12 años de experiencia en la industria del software. Me especializo en tecnologías como <strong>React</strong>, <strong>TypeScript</strong> y <strong>GraphQL</strong>. Me apasiona crear interfaces de usuario intuitivas, con un fuerte enfoque en el testing, la consistencia de diseño y la experiencia del desarrollador. Valoro la colaboración interdisciplinaria: trabajo en estrecha colaboración con diseñadores, ayudando a convertir las ideas en experiencias satisfactorias. Tengo un fuerte compromiso con mejorar los procesos de equipo y a fomentar flujos de trabajo eficientes y escalables. El crecimiento continuo es fundamental en mi trabajo: siempre busco aprender, evolucionar y perfeccionar mis habilidades, tanto técnicas como colaborativas.",
    "explore": "Este sitio es un espacio donde exploro ideas y pruebo tecnologías diferentes."
  },
  "work": {
    "title": "👷 Mi Experiencia Laboral",
    "description": "Durante mi carrera, trabajé en empresas de diferentes tamaños, desde startups en sus inicios como en una software factory con clientes internacionales, ayudando a los equipos a implementar aplicaciones web. Más recientemente, lideré el desarrollo de una cliente web para una startup enfocada en la sostenibilidad, diseñando y lanzando una SPA completa desde cero. Antes de eso, pasé varios años en Split Software, donde ayudé a desarrollar su plataforma de feature flagging y a mejorar los procesos de frontend.",
    "downloadCv": "Descargar mi CV"
  },
  "blog": {
    "title": "✍️ Escribiendo sobre crear para la web",
    "description": "Notas sobre las herramientas, experimentos y aprendizajes que influyen en mi trabajo diario.",
    "sectionHeading": "Última entrada",
    "featuredLabel": "Entrada destacada",
    "readingTime": "{minutes} min de lectura",
    "commentsPlannedTitle": "Los comentarios llegarán pronto",
    "commentsPlannedBody": "Antes de habilitarlos quiero definir bien la moderación. Mientras tanto, podemos conversar por LinkedIn o GitHub."
  }
}
